Repository: common-repository/sharpay
Catalog: languages/sharpay-plugin-*.po
Languages: ru_ru

source: This plugin requires WordPress version %s or higher
ru_ru: Для этого плагина требуется версия WordPress %s или выше

source: Settings
ru_ru: Настройки

source: To use Sharpay multishare button widget you need to set up site ID in plugin's settings first.
ru_ru: Чтобы использовать виджет Sharpay, сначала необходимо настроить идентификатор сайта в настройках плагина.

source: Sharpay Plugin Settings
ru_ru: Настройки плагина Sharpay

source: Sharpay Settings
ru_ru: Настройки Sharpay

source: Sharpay project ID
ru_ru: Sharpay ID проекта

source: Get your project ID or register new project for your site in Sharpay
ru_ru: Получите ID своего проекта или зарегистрируйте новый проект для своего сайта в Sharpay

source: To make Sharpay multisharing button work you need to register your site as a project in <a href="https://app.sharpay.io" target="_blank">app.sharpay.io</a> and provide project's ID
ru_ru: Для работы кнопки шеринга Sharpay необходимо зарегистрировать свой сайт как проект в <a href=\"https://app.sharpay.io\" target=\"_blank\">app.sharpay.io</a> и указать идентификатор проекта в настройках плагина

source: Static button
ru_ru: Статическая кнопка

source: (recommended)
ru_ru: (рекомендовано)

source: Share button at the TOP of every post/page
ru_ru: Кнопка «Поделиться» в ВЕРХНЕЙ части каждого поста/страницы

source: Share button at the BOTTOM of every post/page
ru_ru: Кнопка «Поделиться» в НИЖНЕЙ части каждого поста/страницы

source: Share button anywhere INSIDE CONTENT using [sharpay] shortcode
ru_ru: Кнопка «Поделиться» влюбом месте ВНУТРИ КОНТЕНТА с использованием шорткода [sharpay]

source: Floating button
ru_ru: Плавающая кнопка

source: Floating button at the BOTTOM of the page
ru_ru: Плавающая кнопка в НИЖНЕЙ части страницы

source: If you want to use the advanced settings of Sharpay widgets, use the html embed code from your Sharpay <a href="https://app.sharpay.io/webmaster">webmaster area</a>.
ru_ru: Если вы хотите использовать рассширенные настройки виджетов Sharpay, воспользуйтесь вставкой html-кода через из кабинета <a>вебмастера</a>.

source: Left
ru_ru: Слева

source: Right
ru_ru: Справа

source: Select floating button position at the bottom of the page.
ru_ru: Выберите положение плавающей кнопки внизу страницы.

source: Light
ru_ru: Светлая

source: Dark
ru_ru: Темная

source: Select floating button style.
ru_ru: Выберите стиль плавающий кнопки.

source: Share counter
ru_ru: Счетчик шерингов

source: Separate for every page
ru_ru: Отдельно для каждой страницы

source: Common for all site
ru_ru: Общий для всего сайта

source: Check if you want our button to show how many times your page was shared via Sharpay.
ru_ru: Отметьте если хотите, чтобы кнопка показывала, сколько раз поделились ссылкой на страницу через Sharpay.

source: Enter class, id or URL of an image to make it selected by default in sharing window.
ru_ru: Введите CSS класс, ID или URL-адрес изображения, чтобы сделать его выбранным по умолчанию в окне шеринга.

source: Set button height to make button smaller. Button width will change accordingly.
ru_ru: Установите высоту кнопки, чтобы сделать ее меньше или больше. Ширина кнопки изменится соответственно.

source: Would you like to use custom colors for Sharpay button?
ru_ru: Хотите использовать нестандартные цвета для кнопки Sharpay?

source: Font color
ru_ru: Цвет шрифта

source: Background color
ru_ru: Фоновый цвет

source: Would you like to use your own HTML markup for Sharpay button?
ru_ru: Хотите использовать свою собственную HTML-разметку для кнопки Sharpay?

source: Enter HTML markup which represents your custom multishare button.
ru_ru: Введите HTML-разметку вашей кнопки.
